#problem 0 
a = 'напишем сначало в маленьком, а потом в большом'
print(a)
print(a.upper())
#problem 1
print(1 + 1 == 2)
#problem 2
a = input(">")
b = 'GidHub'
print(a.join(b))
#problem 3
a = 3
b = 'Ботнет IPStorm , в который ранее входили лишь Windows-машины, увеличился до 13 500 зараженных систем'
print(b.replace('е', '3'))
#problem 4
print("Привет!")
a = input("Ведите свой возраст>")
b = input("А теперь ваш любимый фильм>")
print(f"{b} весьма неплохой выбор для {a} лет!")
#problem 5
a = 'Google создаст специальную команду для поиска багов в особо важных приложениях.'
b = a.count(" ") + 1
print(f"В предложении 'Google создаст специальную команду для поиска багов в особо важных приложениях.' {b} слов!")
#problem 6
a = '|'
b = 'Самые важные собЫтия в миРе инфосека за сентябрь'
print(a.join(b) + "|")
#problem 7
a = 'Xакеры слили в сеть данные пакистанской энергетической компании k-Electric'
print(a.upper())
